---
kind: other
id: Methods.T:Autodesk.Revit.DB.SweptProfile
source: html/05f5228e-8265-f685-a5bc-1f5d15f50092.htm
---
# SweptProfile Methods

Provides access to the curve that dictates the path of the swept profile.